{
  "Apple___Apple_scab": "Apple scab is caused by the fungus Venturia inaequalis. It thrives in cool, wet weather and spreads through spores.",
  "Apple___Black_rot": "Black rot is caused by the fungus Botryosphaeria obtusa. It affects fruit, leaves, and branches.",
  "Apple___Cedar_apple_rust": "Cedar apple rust is caused by the fungus Gymnosporangium juniperi-virginianae. It requires both apple and cedar trees to complete its life cycle.",
  "Apple___healthy": "The plant is healthy and shows no signs of disease.",
  "Blueberry___healthy": "The plant is healthy and shows no signs of disease.",
  "Cherry_(including_sour)___Powdery_mildew": "Powdery mildew is caused by the fungus Podosphaera clandestina. It thrives in warm, dry conditions.",
  "Cherry_(including_sour)___healthy": "The plant is healthy and shows no signs of disease.",
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Gray leaf spot is caused by the fungus Cercospora zeae-maydis. It thrives in warm, humid conditions.",
  "Corn_(maize)___Common_rust_": "Common rust is caused by the fungus Puccinia sorghi. It thrives in cool, wet weather.",
  "Corn_(maize)___Northern_Leaf_Blight": "Northern leaf blight is caused by the fungus Exserohilum turcicum. It thrives in warm, humid conditions.",
  "Corn_(maize)___healthy": "The plant is healthy and shows no signs of disease.",
  "Grape___Black_rot": "Black rot is caused by the fungus Guignardia bidwellii. It thrives in warm, humid conditions.",
  "Grape___Esca_(Black_Measles)": "Esca is caused by a complex of fungi, including Phaeomoniella chlamydospora and Phaeoacremonium aleophilum.",
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Leaf blight is caused by the fungus Isariopsis griseola. It thrives in warm, humid conditions.",
  "Grape___healthy": "The plant is healthy and shows no signs of disease.",
  "Orange___Haunglongbing_(Citrus_greening)": "Citrus greening is caused by the bacterium Candidatus Liberibacter asiaticus. It is spread by the Asian citrus psyllid.",
  "Peach___Bacterial_spot": "Bacterial spot is caused by the bacterium Xanthomonas arboricola pv. pruni. It thrives in warm, wet conditions.",
  "Peach___healthy": "The plant is healthy and shows no signs of disease.",
  "Pepper,_bell___Bacterial_spot": "Bacterial spot is caused by the bacterium Xanthomonas campestris pv. vesicatoria. It thrives in warm, wet conditions.",
  "Pepper,_bell___healthy": "The plant is healthy and shows no signs of disease.",
  "Potato___Early_blight": "Early blight is caused by the fungus Alternaria solani. It thrives in warm, humid conditions.",
  "Potato___Late_blight": "Late blight is caused by the fungus Phytophthora infestans. It thrives in cool, wet conditions.",
  "Potato___healthy": "The plant is healthy and shows no signs of disease.",
  "Raspberry___healthy": "The plant is healthy and shows no signs of disease.",
  "Soybean___healthy": "The plant is healthy and shows no signs of disease.",
  "Squash___Powdery_mildew": "Powdery mildew is caused by the fungus Podosphaera xanthii. It thrives in warm, dry conditions.",
  "Strawberry___Leaf_scorch": "Leaf scorch is caused by the fungus Diplocarpon earlianum. It thrives in warm, humid conditions.",
  "Strawberry___healthy": "The plant is healthy and shows no signs of disease.",
  "Tomato___Bacterial_spot": "Bacterial spot is caused by the bacterium Xanthomonas campestris pv. vesicatoria. It thrives in warm, wet conditions.",
  "Tomato___Early_blight": "Early blight is caused by the fungus Alternaria solani. It thrives in warm, humid conditions.",
  "Tomato___Late_blight": "Late blight is caused by the fungus Phytophthora infestans. It thrives in cool, wet conditions.",
  "Tomato___Leaf_Mold": "Leaf mold is caused by the fungus Passalora fulva. It thrives in warm, humid conditions.",
  "Tomato___Septoria_leaf_spot": "Septoria leaf spot is caused by the fungus Septoria lycopersici. It thrives in warm, humid conditions.",
  "Tomato___Spider_mites Two-spotted_spider_mite": "Spider mites are tiny arachnids that feed on plant sap, causing yellowing and stippling of leaves.",
  "Tomato___Target_Spot": "Target spot is caused by the fungus Corynespora cassiicola. It thrives in warm, humid conditions.",
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "Tomato yellow leaf curl virus is transmitted by the whitefly Bemisia tabaci. It causes stunting and yellowing of leaves.",
  "Tomato___Tomato_mosaic_virus": "Tomato mosaic virus is transmitted by contact or through seeds. It causes mottling and distortion of leaves.",
  "Tomato___healthy": "The plant is healthy and shows no signs of disease."
}
